app/controllers/api/v1/api_controller.rb

SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "product_variants".* FROM "product_variants" WHERE "product_variants"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "store_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["store_id", 5], ["created_at", "2020-11-25 06:06:49.969852"], ["updated_at", "2020-11-25 06:06:49.969852"]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."store_id" = $2 LIMIT $3  [["user_id", 1], ["store_id", 1], ["LIMIT", 1]]
---
      def find_cart
        # add product to chart
        @quantity = params[:cart][:quantity].to_i
        product_variant_id = params[:cart][:product_variant_id]
        @store = Store.find params[:cart][:store_id]
        @notes = params[:cart][:notes]

        @product_variant = ProductVariant.find(product_variant_id)
        @cart = Cart.find_or_create_by(user_id: current_user.id, store_id: @store.id)