app/controllers/api/v1/carts_controller.rb

      def add_to_cart
        # add to chart
        @cart.add(@product_variant, @product_variant.product.price, @quantity)
        # adding notes, product id ( since its use gem i should update it manually)
        cart_item = ShoppingCartItem.where(owner_id: @cart.id, owner_type: 'Cart', item_id: @product_variant.id).first
        cart_item.update_columns(notes: @notes, product_id: @product_variant.product.id)
---
SELECT "shopping_cart_items".* FROM "shopping_cart_items" WHERE "shopping_cart_items"."owner_id" = $1 AND "shopping_cart_items"."owner_type" = $2 AND "shopping_cart_items"."item_id" = $3 ORDER BY "shopping_cart_items"."id" ASC LIMIT $4  [["owner_id", 11], ["owner_type", "Cart"], ["item_id", 42], ["LIMIT", 1]]
UPDATE "shopping_cart_items" SET "notes" = $1, "product_id" = $2 WHERE "shopping_cart_items"."id" = $3  [["notes", "Beli yang banyak 90"], ["product_id", 5], ["id", 17]]

      def remove_cart_item
        # remove product / quantity from chart
        qty = params[:cart][:quantity].to_i
        cart = Cart.where(user_id: current_user.id, store_id: params[:cart][:store_id]).first
        product_variant = ProductVariant.find(params[:cart][:product_variant_id])
        return render json: {status: :error, code: 442, message: "Cart Not Found"} if cart.blank?

        cart_item = ShoppingCartItem.where(owner_id: cart.id, owner_type: 'Cart', item_id: product_variant.id).first
        if qty > 0
          cart_item.update_columns(quantity: cart_item.quantity - qty)
        else
          cart_item.delete
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."store_id" = $2 ORDER BY "carts"."id" ASC LIMIT $3  [["user_id", 1], ["store_id", 5], ["LIMIT", 1]]
SELECT "product_variants".* FROM "product_variants" WHERE "product_variants"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."store_id" IS NULL  [["user_id", 1]]
SELECT "shopping_cart_items".* FROM "shopping_cart_items" WHERE "shopping_cart_items"."owner_id" = $1 AND "shopping_cart_items"."owner_type" = $2 AND "shopping_cart_items"."item_id" = $3 ORDER BY "shopping_cart_items"."id" ASC LIMIT $4  [["owner_id", 21], ["owner_type", "Cart"], ["item_id", 42], ["LIMIT", 1]]
UPDATE "shopping_cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "shopping_cart_items"."id" = $3  [["quantity", 9], ["updated_at", "2020-11-24 07:35:33.218591"], ["id", 6]]
DELETE FROM "shopping_cart_items" WHERE "shopping_cart_items"."id" = $1  [["id", 16]]

      def remove_carts
        carts = Cart.where(user_id: current_user.id).select(:id)
        carts.each do |cart|
          cart.clear
        end
        carts.delete_all
---
SELECT "carts"."id" FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 1]]
DELETE FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 1]]

      def index
        # get list item from chart'
        carts = Cart.where(user_id: current_user.id)
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 1]]