app/controllers/api/v1/orders_controller.rb

      def index
        # get order listing item
        orders  = current_user.orders
        json_product = OrderSerializer.new(orders, include: [:order_stores, "order_stores.order_products", "order_stores.order_products.product_variant", "order_stores.order_products.product_variant.product"]).serializable_hash.to_json
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_store_id" = $1  [["order_store_id", 1]]
SELECT "order_stores"."id" FROM "order_stores" WHERE "order_stores"."order_id" = $1  [["order_id", 1]]

      def create
        order = Order.new(order_params)
        order.valid?
        if order.save
---
INSERT INTO "orders" ("user_id", "total_price_items", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["total_price_items", "30000000.0"], ["created_at", "2020-11-25 07:41:55.954746"], ["updated_at", "2020-11-25 07:41:55.954746"]]