app/controllers/api/v1/products_controller.rb

        def index
          q = Product.ransack(name_i_cont: params[:q])
          products =  q.result.includes([:product_variants, :store])
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" IN ($1, $2, $3, $4)  [["id", 1], ["id", 3], ["id", 4], ["id", 5]]
SELECT "product_variants".* FROM "product_variants" WHERE "product_variants"."product_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["product_id", 1], ["product_id", 2], ["product_id", 3], ["product_id", 4], ["product_id", 5], ["product_id", 6], ["product_id", 7], ["product_id", 8], ["product_id", 9], ["product_id", 10]]
SELECT "products".* FROM "products"