app/models/order.rb

  def set_total
    self.total_price_items = 0
    self.order_stores.each do |os|
      os.total = 0
      os.order_products.each do |op|
        cart_item = ShoppingCartItem.find(op.shopping_cart_item_id)
---
SELECT "shopping_cart_items".* FROM "shopping_cart_items" WHERE "shopping_cart_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]